akwalker2048/stm32f4_generic_template/src/hardware_STM32F407G_DISC1.c
#include "stm32f4xx_conf.h"
#include "hardware_STM32F407G_DISC1.h"
#include "hardware_TB6612.h"
#include "tilt_motor_control.h"
#include "quad_encoder.h"

/* Global variable for handling USART so that whole packets are sent at a
 * a time.  In the future, I need to just add a function that is in this
 * file that controls all packet sending.  Maybe implement a circular
 * packet buffer for sending.
 */
volatile uint8_t packet_send_mutex = 0;

volatile uint8_t grab_frame = 0;
volatile uint8_t send_code_version = 0;

#define USART3_CIRC_BUFFER_SIZE 256
volatile uint8_t usart3_circ_buffer[USART3_CIRC_BUFFER_SIZE];
volatile uint8_t usart3_circ_buffer_head = 0;
volatile uint8_t usart3_circ_buffer_tail = 0;

volatile uint8_t sonar_index = 0;
volatile uint8_t sonar_data[4];

#define TS_CIRC_BUFFER_SIZE 8
volatile GenericPacket ts_circ_buffer[TS_CIRC_BUFFER_SIZE];
volatile uint32_t ts_circ_buffer_head = 0;
volatile uint32_t ts_circ_buffer_tail = 0;

#define VOSPI_CIRC_BUFFER_SIZE 128
volatile GenericPacket vospi_circ_buffer[VOSPI_CIRC_BUFFER_SIZE];
volatile uint32_t vospi_circ_buffer_head = 0;
volatile uint32_t vospi_circ_buffer_tail = 0;

#define OUTGOING_CIRC_BUFFER_SIZE 16
GenericPacket outgoing_circ_buffer[OUTGOING_CIRC_BUFFER_SIZE];
volatile uint32_t outgoing_circ_buffer_head = 0;
volatile uint32_t outgoing_circ_buffer_head_temp = 0;
volatile uint32_t outgoing_circ_buffer_tail = 0;

#define INCOMING_CIRC_BUFFER_SIZE 16
GenericPacket incoming_circ_buffer[INCOMING_CIRC_BUFFER_SIZE];
volatile uint32_t incoming_circ_buffer_head = 0;
volatile uint32_t incoming_circ_buffer_head_temp = 1;
volatile uint32_t incoming_circ_buffer_tail = 0;


/* Variables Global Within This File */
uint8_t gpio_initialized = 0;
uint8_t systick_initialized = 0;
uint8_t usart_one_initialized = 0;
uint8_t usart_one_dma_initialized = 0;
uint8_t usart_three_initialized = 0;
uint8_t pushbutton_initialized = 0;
uint8_t analog_input_initialized = 0;
uint8_t adc_initialized = 0;
uint8_t tia_initialized = 0;
uint8_t spi_initialized = 0;
uint8_t i2c_initialized = 0;

/* Circular Receive Buffer */
#define RX_BUFFER_SIZE (GP_MAX_PACKET_LENGTH * 16)
uint8_t rx_buffer[RX_BUFFER_SIZE];
uint16_t rx_buffer_head = 0;
uint16_t rx_buffer_tail = 0;
/* GenericPacket receive_packet; */

/* USART DMA Buffers */
#define DMA_RX_BUFFER_SIZE (GP_MAX_PACKET_LENGTH * 4)
uint8_t usart_dma_tx_buffer[GP_MAX_PACKET_LENGTH];
uint8_t usart_dma_rx_buffer[DMA_RX_BUFFER_SIZE];
uint16_t dma_rx_buffer_head = 0;
uint16_t dma_rx_buffer_tail = 0;
GenericPacket receive_packet;

/* Free Running Coutner */
volatile uint32_t ms_counter = 0;
/* Resettable Counter */
volatile uint32_t ms_count_r = 0;

/* ****************************************************************** */
/* GPIO Initialization                                                */
/* ****************************************************************** */
/* Only purely GPIO should be initialized here.  Other pins should be *
 * initialized in their respective init functions as needed.          *
 * ****************************************************************** */
void init_gpio(void)
{
   GPIO_InitTypeDef  GPIO_InitStructure;

   /* Init LEDs */
   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
   GPIO_InitStructure.GPIO_Pin = LED_PIN_RED | LED_PIN_GREEN | LED_PIN_BLUE | LED_PIN_ORANGE;
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
   GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
   GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
   GPIO_Init(GPIOD, &GPIO_InitStructure);

   gpio_initialized = 1;
}

/* ****************************************************************** */
/* TIM Interrupt Initialization                                       */
/* ****************************************************************** */
void init_systick(void)
{
   /* Make sure we are using the correct value for SystemCoreClock! */
   SystemCoreClockUpdate();
   /* Set SysTick to expire every ms. */
   if (SysTick_Config(SystemCoreClock / 1000))
   {
      /* Capture error */
      while (1);
   }

   systick_initialized = 1;
}

/* ****************************************************************** */
/* USART Initialization                                               */
/* ****************************************************************** */
void init_usart_three(void)
{
   USART_InitTypeDef USART_InitStructure;
   NVIC_InitTypeDef NVIC_InitStructure;
   GPIO_InitTypeDef  GPIO_InitStructure;

   /* Init USART Pins */
   /* USART3 has three pinouts on this card:
    *   TX -> B10 | C10 | D8
    *   RX -> B11 | C11 | D9
    *
    *   I'll start with D8 and D9 because those pins aren't mapped to many
    *   other functions.
    */

   /* Enable GPIO clock */
   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
   /* Connect PXx to USARTx_Tx*/
   GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_USART3);
   /* Connect PXx to USARTx_Rx */
   GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_USART3);
   /* Configure USART Tx as alternate function  */
   GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
   GPIO_Init(GPIOD, &GPIO_InitStructure);
   /* Configure USART Rx as alternate function  */
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
   GPIO_Init(GPIOD, &GPIO_InitStructure);

   RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);

   /* USART_InitStructure.USART_BaudRate = 115200; */
   USART_InitStructure.USART_BaudRate = 9600;
   USART_InitStructure.USART_WordLength = USART_WordLength_8b;
   USART_InitStructure.USART_StopBits = USART_StopBits_1;
   USART_InitStructure.USART_Parity = USART_Parity_No;
   USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
   USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
   /* USART_InitStructure.USART_Mode = USART_Mode_Rx; */

