akwalker2048/stm32f4_generic_template/src/hardware_STM32F407G_DISC1.c
   USART_OverSampling8Cmd(USART3, ENABLE);

   /* USART configuration */
   USART_Init(USART3, &USART_InitStructure);

   /* Enable the USARTx Interrupt */
   NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
   NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
   NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
   NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
   NVIC_Init(&NVIC_InitStructure);

   /* Enable the interrupt for Receive Not Empty */
   USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);

   /* Enable USART */
   USART_Cmd(USART3, ENABLE);

   usart_three_initialized = 1;

   /* /\* AT+BAUD8 -> Change to 115200 *\/ */
   /* usart_three_write_byte('A'); */
   /* usart_three_write_byte('T'); */
   /* usart_three_write_byte('+'); */
   /* usart_three_write_byte('B'); */
   /* usart_three_write_byte('A'); */
   /* usart_three_write_byte('U'); */
   /* usart_three_write_byte('D'); */
   /* usart_three_write_byte('8'); */

   /*  /\* /\\* AT+BAUD8 -> Change to 115200 *\\/ *\/ */
   /* usart_three_write_byte('A'); */
   /* usart_three_write_byte('T'); */
   /* usart_three_write_byte('+'); */
   /* usart_three_write_byte('B'); */
   /* usart_three_write_byte('A'); */
   /* usart_three_write_byte('U'); */
   /* usart_three_write_byte('D'); */
   /* usart_three_write_byte('8'); */

   /* /\* Reconfigure things! *\/ */
   /* usart_three_initialized = 0; */
   /* USART_Cmd(USART3, DISABLE); */
   /* USART_InitStructure.USART_BaudRate = 115200; */
   /* USART_Init(USART3, &USART_InitStructure); */
   /* USART_Cmd(USART3, ENABLE); */
   /* usart_three_initialized = 1; */

}

void init_usart_one(void)
{
   USART_InitTypeDef USART_InitStructure;
   NVIC_InitTypeDef NVIC_InitStructure;
   GPIO_InitTypeDef  GPIO_InitStructure;

   /* Init USART Pins */
   /* USART1:
    *   TX -> B6
    *   RX -> B7
    */

   /* Enable the USART Clock */
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

   /* Enable GPIO clock */
   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
   /* Connect PXx to USARTx_Tx*/
   GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_USART1);
   /* Connect PXx to USARTx_Rx*/
   GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_USART1);
   /* Configure USART Tx as alternate function */
   GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
   GPIO_Init(GPIOB, &GPIO_InitStructure);
   /* Configure USART Rx as alternate function  */
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
   GPIO_Init(GPIOB, &GPIO_InitStructure);

   /* USART_InitStructure.USART_BaudRate = 115200; */
   USART_InitStructure.USART_BaudRate = 3000000;
   USART_InitStructure.USART_WordLength = USART_WordLength_8b;
   USART_InitStructure.USART_StopBits = USART_StopBits_1;
   USART_InitStructure.USART_Parity = USART_Parity_No;
   USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
   USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
   /* USART_InitStructure.USART_Mode = USART_Mode_Tx; */

   USART_OverSampling8Cmd(USART1, ENABLE);

   /* USART configuration */
   USART_Init(USART1, &USART_InitStructure);

   /* Enable the USARTx Interrupt */
   NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
   NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
   NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
   NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
   NVIC_Init(&NVIC_InitStructure);

   /* Enable the interrupt for Receive Not Empty */
   USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);

   /* Enable USART */
   USART_Cmd(USART1, ENABLE);

   usart_one_initialized = 1;
   usart_one_dma_initialized = 0;

}



void init_usart_one_dma(void)
{
   USART_InitTypeDef USART_InitStructure;
   NVIC_InitTypeDef NVIC_InitStructure;
   GPIO_InitTypeDef  GPIO_InitStructure;
   DMA_InitTypeDef  DMA_InitStructure;

   uint8_t retval;

   /* Init USART Pins */
   /* USART1:
    *   TX -> B6
    *   RX -> B7
    */

   /* Enable DMA Clock */
   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
   /* Enable the USART Clock */
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

   /* Enable GPIO clock */
   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
   /* Connect PXx to USARTx_Tx*/
   GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_USART1);
   /* Connect PXx to USARTx_Rx*/
   GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_USART1);
   /* Configure USART Tx as alternate function */
   GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
   GPIO_Init(GPIOB, &GPIO_InitStructure);
   /* Configure USART Rx as alternate function  */
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
   GPIO_Init(GPIOB, &GPIO_InitStructure);


   /* USART_InitStructure.USART_BaudRate = 115200; */
   USART_InitStructure.USART_BaudRate = 3000000;
   /* USART_InitStructure.USART_BaudRate = 1500000; */
   USART_InitStructure.USART_WordLength = USART_WordLength_8b;
   USART_InitStructure.USART_StopBits = USART_StopBits_1;
   USART_InitStructure.USART_Parity = USART_Parity_No;
   USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
   USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
   /* USART_InitStructure.USART_Mode = USART_Mode_Tx; */

   USART_OverSampling8Cmd(USART1, ENABLE);

   /* USART configuration */
   USART_Init(USART1, &USART_InitStructure);

   /* /\* Enable the USARTx Interrupt *\/ */
   /* NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn; */
   /* NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; */
   /* NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0; */
   /* NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; */
   /* NVIC_Init(&NVIC_InitStructure); */

