akwalker2048/stm32f4_generic_template/src/hardware_STM32F407G_DISC1.c
   /* /\* Enable the interrupt for Receive Not Empty *\/ */
   /* USART_ITConfig(USART1, USART_IT_RXNE, ENABLE); */


   /* Set up DMA Here!!!! */
   /* Configure TX DMA */
   DMA_DeInit(DMA2_Stream7);
   DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
   DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull;
   DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
   DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
   DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
   DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
   DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) (&(USART1->DR));
   DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
   DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
   DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
   DMA_InitStructure.DMA_Priority = DMA_Priority_High;
   DMA_InitStructure.DMA_BufferSize = GP_MAX_PACKET_LENGTH;
   DMA_InitStructure.DMA_Channel = DMA_Channel_4;
   DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
   DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)usart_dma_tx_buffer;
   DMA_Init(DMA2_Stream7, &DMA_InitStructure);
   /* Configure RX DMA */
   DMA_DeInit(DMA2_Stream5);
   DMA_InitStructure.DMA_Channel = DMA_Channel_4;
   DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
   DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)usart_dma_rx_buffer;
   DMA_InitStructure.DMA_BufferSize = (uint16_t)sizeof(usart_dma_rx_buffer);
   DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) (&(USART1->DR));
   DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
   DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
   DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
   DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
   DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
   DMA_InitStructure.DMA_Priority = DMA_Priority_High;
   DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
   /* DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable; */
   /* DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full; */
   DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull;
   /* DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single; */
   DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_INC4;
   DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
   DMA_Init(DMA2_Stream5, &DMA_InitStructure);
   /* Enable the USART Rx DMA request */
   USART_DMACmd(USART1, USART_DMAReq_Rx, ENABLE);
   /*   /\* Enable DMA Stream Half Transfer and Transfer Complete interrupt *\/ */
   /*   DMA_ITConfig(DMA1_Stream2, DMA_IT_TC | DMA_IT_HT , ENABLE); */
   /* Enable the DMA RX Stream */
   DMA_Cmd(DMA2_Stream5, ENABLE);

   retval = gp_receive_byte(0x00, GP_CONTROL_INITIALIZE, &(incoming_circ_buffer[incoming_circ_buffer_head_temp]));

   /* DMA_InitStructure.DMA_BufferSize = RX_BUFFER_SIZE; */
   /* DMA_InitStructure.DMA_Channel = DMA_Channel_4; */
   /* DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory; */
   /* DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)usart_dma_rx_buffer; */
   /* DMA_Init(DMA2_Stream5, &DMA_InitStructure); */

   /* Enable USART */
   USART_Cmd(USART1, ENABLE);

   usart_one_dma_initialized = 1;
   usart_one_initialized = 0;
}

/* ****************************************************************** */
/* ADC  Initialization                                         */
/* ****************************************************************** */
void init_adc(void)
{
   GPIO_InitTypeDef GPIO_InitStructure; //Variable used to setup the GPIO pins
   DMA_InitTypeDef DMA_InitStructure; //Variable used to setup the DMA
   ADC_InitTypeDef ADC_InitStructure; //Variable used to setup the ADC
   ADC_CommonInitTypeDef ADC_CommonInitStructure;

   RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

   GPIO_StructInit(&GPIO_InitStructure);
   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
   GPIO_Init(GPIOC, &GPIO_InitStructure);

   /* I think you can also hook up the battery voltage internally to the ADC. I
      need to look into that and add the capability here.
   */

   /* ADC Common Init */
   ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent;
   ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div8;
   ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled;
   ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_12Cycles;
   ADC_CommonInit(&ADC_CommonInitStructure);

   /* Init ADC1 Specific Stuff */
   ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
   ADC_InitStructure.ADC_ScanConvMode = DISABLE;
   ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
   ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
   ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_TRGO; /* Actually...a don't care... */
   ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
   ADC_InitStructure.ADC_NbrOfConversion = 1;
   ADC_Init(ADC1, &ADC_InitStructure); //Initialise ADC1

   ADC_Cmd(ADC1, ENABLE); //Enable ADC1

   /* Need to calibrate the ADC??? */

   adc_initialized = 1;

}


/* ****************************************************************** */
/* Pushbutton  Initialization                                         */
/* ****************************************************************** */
void init_pushbutton(void)
{

   GPIO_InitTypeDef  GPIO_InitStructure;
   EXTI_InitTypeDef   EXTI_InitStructure;
   NVIC_InitTypeDef   NVIC_InitStructure;

   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

   GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
   GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
   GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
   GPIO_Init(GPIOD, &GPIO_InitStructure);

