akwalker2048/stm32f4_generic_template/src/hardware_STM32F407G_DISC1.c
   /* Connect PXx to I2C_SDA */
   GPIO_PinAFConfig(GPIOB, GPIO_PinSource9, GPIO_AF_I2C1);

   /* Configure I2C Filters */
   I2C_AnalogFilterCmd(I2C1, ENABLE);
   I2C_DigitalFilterConfig(I2C1, 0x0F);

   /* I2C Struct Initialize */
   I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
   I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
   I2C_InitStructure.I2C_OwnAddress1 = 0xA0;
   I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
   I2C_InitStructure.I2C_ClockSpeed = 100000;
   I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;

   /* I2C Initialize */
   I2C_Init(I2C1, &I2C_InitStructure);

   i2c_initialized = 1;

}


/* ****************************************************************** */
/* ????  Initialization                                               */
/* ****************************************************************** */





/* ****************************************************************** */
/* SysTick Handler  (moved from stm32f4xx_it.c)                       */
/* ****************************************************************** */
void SysTick_Handler(void)
{
   static uint32_t ii = 0;

   static uint8_t up = 1;

   uint8_t retval;

   uint8_t temp_head;

   extern uint8_t lepton_phase_offset;

   static float duty = -1.0f;

   float current_tilt_position;

   ms_counter++;
   ms_count_r++;

   ii++;

   /* Check USART DMA Receive Circular Buffer */
   dma_rx_buffer_head = (DMA_RX_BUFFER_SIZE - DMA2_Stream5->NDTR);
   /* ustr_ii = 0; */
   while(dma_rx_buffer_tail != dma_rx_buffer_head)
   {

      rx_buffer[rx_buffer_head] = usart_dma_rx_buffer[dma_rx_buffer_tail];
      rx_buffer_head++;
      if(rx_buffer_head >= RX_BUFFER_SIZE)
      {
         rx_buffer_head = 0;
      }

      dma_rx_buffer_tail++;
      if(dma_rx_buffer_tail >= DMA_RX_BUFFER_SIZE)
      {
         dma_rx_buffer_tail = 0;
      }
   }


   /* if(ms_counter%(2000) == 0) */
   if((ms_counter + lepton_phase_offset)%(185) == 0)
   {
      /* Kick off one frame grab. */
      if(grab_frame == 2)
      {
         grab_frame = 1;
      }

      if(grab_frame == 3)
      {
         grab_frame = 2;
      }

   }


   /* tilt_motor_get_angle(&current_tilt_position); */
   /* if(current_tilt_position > TILT_MAX_ANGLE_RAD) */
   /* { */
   /*    TB6612_set_duty(-0.20); */
   /* } */

   /* if(current_tilt_position < TILT_MIN_ANGLE_RAD) */
   /* { */
   /*    TB6612_set_duty(0.20); */
   /* } */

   /* if(ms_counter%100 == 0) */
   /* { */

   /*    if(up == 1) */
   /*    { */
   /*       duty = duty + 0.05f; */
   /*       if(duty >= 0.50f) */
   /*       { */
   /*          up = 0; */
   /*       } */
   /*    } */
   /*    else */
   /*    { */
   /*       duty = duty - 0.05f; */
   /*       if(duty <= 0.05f) */
   /*       { */
   /*          up = 1; */
   /*       } */
   /*    } */
   /*    TB6612_set_duty(duty); */

   /* } */

   if(ms_counter%100 == 0)
   {

      temp_head = ts_circ_buffer_head + 1;
      if(temp_head >= TS_CIRC_BUFFER_SIZE)
      {
         temp_head = 0;
      }
      create_universal_timestamp((GenericPacket *)&ts_circ_buffer[temp_head], ms_counter);
      ts_circ_buffer_head = temp_head;

   }



   if(ms_counter%50 == 0)
   {

      send_code_version = 1;

      if(GPIO_ReadInputDataBit(GPIOD, LED_PIN_GREEN) == Bit_SET)
      {
         GPIO_ResetBits(GPIOD, LED_PIN_GREEN);
         GPIO_SetBits(GPIOD, LED_PIN_BLUE);

      }
      else
      {
         GPIO_SetBits(GPIOD, LED_PIN_GREEN);
         GPIO_ResetBits(GPIOD, LED_PIN_BLUE);

      }


   }


}


/* ****************************************************************** */
/* USART3 Handler                                                     */
/* ****************************************************************** */
void USART3_IRQHandler(void)
{
   uint16_t tchar;
   uint8_t temp_head;

   if(USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)
   {
      /* Read one byte from the receive data register */
      tchar = (USART_ReceiveData(USART3) & 0x7F);

      /* Just drop the byte in a circular buffer and deal with it later. */
      temp_head = usart3_circ_buffer_head + 1;
      if(temp_head >= USART3_CIRC_BUFFER_SIZE)
      {
         temp_head = 0;
      }
      usart3_circ_buffer[temp_head] = (uint8_t)tchar;
      /* usart3_circ_buffer[temp_head] = ~usart3_circ_buffer[temp_head]; */
      usart3_circ_buffer_head = temp_head;


      /* Echo what we just got! */
      /* USART_SendData(USART3, tchar); */
      /* usart_write_byte((uint8_t)tchar); */
   }

}

void USART1_IRQHandler(void)
{
   uint16_t tchar;

   if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)
   {
      /* Read one byte from the receive data register */
      rx_buffer[rx_buffer_head] = (uint8_t)(USART_ReceiveData(USART1) & 0x7F);
      rx_buffer_head++;
      if(rx_buffer_head >= RX_BUFFER_SIZE)
      {
         rx_buffer_head = 0;
      }
      /* Echo what we just got! */
      /* USART_SendData(USART3, tchar); */
      /* usart_write_byte((uint8_t)tchar); */
   }

}



/* ****************************************************************** */
/* Pushbutton Handler                                                 */
/* ****************************************************************** */
void EXTI0_IRQHandler(void)
{
   if(EXTI_GetITStatus(EXTI_Line0) != RESET)
   {
      /* /\* Toggle LED1 *\/ */
      /* if(GPIO_ReadInputDataBit(GPIOD, LED_PIN_ORANGE) == Bit_SET) */
      /* { */
      /*    GPIO_ResetBits(GPIOD, LED_PIN_ORANGE); */
      /* } */
      /* else */
      /* { */
      /*    GPIO_SetBits(GPIOD, LED_PIN_ORANGE); */
      /* } */

      /* Zero the tilt motor here for now.  Eventually, we need to tie that to
         the pin that will actually have the flag piped in. */
      /* quad_encoder_set_position(TILT_ZERO_POSITION_QC); */
      /* TB6612_set_duty(0.25); */

      /* Clear the EXTI line 0 pending bit */
      EXTI_ClearITPendingBit(EXTI_Line0);
   }
}



/* ****************************************************************** */
/* Exported Functions                                                 */
/* ****************************************************************** */
uint8_t usart_write_dma(uint8_t *data_ptr, uint32_t data_len)
{

   if(usart_one_dma_initialized)
   {

      /* Enable USART DMA TX Requsts */
      USART_DMACmd(USART1, USART_DMAReq_Tx, ENABLE);
      /* Enable the DMA */
      DMA_Cmd(DMA2_Stream7, ENABLE);


      /* /\* Wait for any previous transfer to complete. *\/ */
      while (USART_GetFlagStatus(USART1, USART_FLAG_TC)==RESET);
      while (DMA_GetFlagStatus(DMA2_Stream7, DMA_FLAG_TCIF7)==RESET);

      /* Disable the DMA */
      DMA_Cmd(DMA2_Stream7, DISABLE);
      /* Disable USART DMA TX Requsts */
      USART_DMACmd(USART1, USART_DMAReq_Tx, DISABLE);

