akwalker2048/stm32f4_generic_template/src/hardware_STM32F407G_DISC1.c
      /* Clear DMA Transfer Complete Flags */
      DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);
      /* Clear USART Transfer Complete Flags */
      USART_ClearFlag(USART1, USART_FLAG_TC);

      /* Set the length of data to transmit. */
      DMA2_Stream7->NDTR = data_len;
      /* Set the pointer to the data. */
      DMA2_Stream7->M0AR = (uint32_t)data_ptr;

      /* Enable USART DMA TX Requsts */
      USART_DMACmd(USART1, USART_DMAReq_Tx, ENABLE);
      /* Enable the DMA */
      DMA_Cmd(DMA2_Stream7, ENABLE);

   }

   return 0;

}

uint8_t usart_write_byte(uint8_t data)
{

   if(usart_one_initialized)
   {
      /* Make sure any previous write has completed. */
      while( !(USART1->SR & 0x00000040) );
      /* Send the data. */
      /* if((0x20 <= data)&&(data <= 0x7E)) */
      /* { */
      USART_SendData(USART1, (uint16_t)data);
      /* } */
   }

   return 0;
}

uint8_t usart_three_write_byte(uint8_t data)
{

   if(usart_three_initialized)
   {
      /* Make sure any previous write has completed. */
      while( !(USART3->SR & 0x00000040) );
      /* Send the data. */
      /* if((0x20 <= data)&&(data <= 0x7E)) */
      /* { */
      USART_SendData(USART3, (uint16_t)data);
      /* } */
   }

   return 0;
}



void spi_cs_enable(void)
{
   GPIO_ResetBits(GPIOB, SPI_PIN_CS_AL);
   blocking_wait_ms(1);
}

void spi_cs_disable(void)
{
   GPIO_SetBits(GPIOB, SPI_PIN_CS_AL);
}

uint8_t spi_read_byte(void)
{
   uint8_t retval;
   uint16_t tmpval;

   while(SPI_I2S_GetFlagStatus(SPI3, SPI_FLAG_TXE) == RESET);
   SPI_I2S_SendData(SPI3, (uint16_t)0x00);
   while(SPI_I2S_GetFlagStatus(SPI3, SPI_FLAG_RXNE) == RESET);
   tmpval = SPI_I2S_ReceiveData(SPI3);
   retval = (uint8_t)(tmpval & 0xFF);

   return retval;

}


void blocking_wait_ms(uint32_t delay_ms)
{
   ms_count_r = 0;
   while(ms_count_r < delay_ms);
}


void non_blocking_wait_ms(uint32_t delay_ms)
{
   /* Need to implement this! */
   /* ms_count_r = 0; */
   /* while(ms_count_r < delay_ms); */
}

void process_rx_buffer(void)
{
   uint8_t retval;
   uint8_t temp[64];
   uint8_t length;
   static uint8_t light_on = 0;

   length = 0;
   while(rx_buffer_head != rx_buffer_tail)
   {



      if(length < 64)
      {
         temp[length] = rx_buffer[rx_buffer_tail];
         length++;
      }

      retval = gp_receive_byte(rx_buffer[rx_buffer_tail], GP_CONTROL_RUN, &(incoming_circ_buffer[incoming_circ_buffer_head_temp]));

      if((retval == GP_CHECKSUM_MATCH))
      {
         if(light_on == 1)
         {
            /* GPIO_ResetBits(GPIOD, LED_PIN_RED); */
            light_on = 0;
         }
         else
         {
            light_on = 1;
            /* GPIO_SetBits(GPIOD, LED_PIN_RED); */
         }

         incoming_circ_buffer_head = incoming_circ_buffer_head_temp;
         incoming_circ_buffer_head_temp++;
         if(incoming_circ_buffer_head_temp >= INCOMING_CIRC_BUFFER_SIZE)
         {
            incoming_circ_buffer_head_temp = 0;
         }
      }

      rx_buffer_tail++;
      if(rx_buffer_tail >= RX_BUFFER_SIZE)
      {
         rx_buffer_tail = 0;
      }


   }
   /* if(length) */
   /* { */
   /*    usart_write_dma(temp, length); */
   /* } */

}



void handle_incoming_packets(void)
{
   GenericPacket *gp;
   uint32_t next_outgoing_head;
   uint8_t retval;

   float proportional, integral, derivative;

   /* if(GPIO_ReadInputDataBit(GPIOD, LED_PIN_ORANGE) == Bit_SET) */
   /* { */
   /*    GPIO_ResetBits(GPIOD, LED_PIN_ORANGE); */
   /* } */
   /* else */
   /* { */
   /*    GPIO_SetBits(GPIOD, LED_PIN_ORANGE); */
   /* } */


   while(incoming_circ_buffer_tail != incoming_circ_buffer_head)
   {
      incoming_circ_buffer_tail = incoming_circ_buffer_tail + 1;
      if(incoming_circ_buffer_tail >= INCOMING_CIRC_BUFFER_SIZE)
      {
         incoming_circ_buffer_tail = 0;
      }

      gp = &(incoming_circ_buffer[incoming_circ_buffer_tail]);

      switch(gp->gp[GP_LOC_PROJ_ID])
      {
         case GP_PROJ_UNIVERSAL:
            {
               switch(gp->gp[GP_LOC_PROJ_SPEC])
               {
                  default:
                     break;
               }
            }
            break;
         case GP_PROJ_MOTOR:
            {
               switch(gp->gp[GP_LOC_PROJ_SPEC])
               {
                  case MOTOR_SET_PID:
                     {
                        /* GPIO_SetBits(GPIOD, LED_PIN_RED); */

                        /* Extract the new values. */
                        extract_motor_set_pid(gp, &proportional, &integral, &derivative);
                        /* Call a function here to set the gains. */
                        retval = tilt_motor_set_pid_gains(proportional, integral, derivative);
                        if(retval == 0)
                        {
                           /* Query the new gains from the motor driver. */
                           proportional = 0.0f;
                           integral = 0.0f;
                           derivative = 0.0f;
                           retval = tilt_motor_query_pid_gains(&proportional, &integral, &derivative);
                           if(retval == 0)
                           {
                              /* Respond with the new gains. */
                              retval = get_next_outgoing_gp_head(&next_outgoing_head);
                              if(retval == 0)
                              {
                                 create_motor_resp_pid(&(outgoing_circ_buffer[next_outgoing_head]), proportional, integral, derivative);
                                 increment_outgoing_gp_head();
                              }
                              else
                              {
                                 /* Someone else was already writing the next outgoing
                                    gp.  We need to handle that somehow.
                                 */
                              }
                           }
                        }
                        /* GPIO_ResetBits(GPIOD, LED_PIN_RED); */
                     }
                     break;
                  case MOTOR_START:
                     {
                        retval = tilt_motor_start();
                        if(retval == 0)
                        {
                           retval = get_next_outgoing_gp_head(&next_outgoing_head);
                           if(retval == 0)
                           {
                              create_motor_start(&(outgoing_circ_buffer[next_outgoing_head]));
                              increment_outgoing_gp_head();
                           }
                           else
                           {
                              /* Someone else was already writing the next outgoing
                                 gp.  We need to handle that somehow.
                              */
                           }
                        }
                     }
                     break;
                  case MOTOR_STOP:
                     {
                        retval = tilt_motor_stop();
                        if(retval == 0)
                        {
                           retval = get_next_outgoing_gp_head(&next_outgoing_head);
                           if(retval == 0)
                           {
                              create_motor_stop(&(outgoing_circ_buffer[next_outgoing_head]));
                              increment_outgoing_gp_head();
                           }
                           else
                           {
                              /* Someone else was already writing the next outgoing
                                 gp.  We need to handle that somehow.
                              */
                           }
                        }
                     }
                  default:
                     break;
               }
               break;

