akwalker2048/stm32f4_generic_template/src/hardware_STM32F407G_DISC1.c
            }

         default:
            break;
      }

   }
}

/* uint8_t add_gp_to_circ_buffer(GenericPacket packet) */
/* { */
/*    uint8_t retval; */
/*    uint8_t temp_head; */
/*    uint8_t ii; */

/*    uint32_t prim; */

/*    /\* Read PRIMASK register, check interrupt status before you disable them *\/ */
/*    /\* Returns 0 if they are enabled, or non-zero if disabled *\/ */
/*    prim = __get_PRIMASK(); */

/*    /\* Disable interrupts *\/ */
/*    __disable_irq(); */

/*    while(packet_send_mutex != 0); */
/*    packet_send_mutex = 1; */
/*    temp_head = gp_circ_buffer_head + 1; */
/*    if(temp_head >= GP_CIRC_BUFFER_SIZE) */
/*    { */
/*       temp_head = 0; */
/*    } */

/*    gp_circ_buffer[temp_head].data_index = 0; */
/*    gp_circ_buffer[temp_head].packet_length = packet.packet_length; */
/*    gp_circ_buffer[temp_head].packet_error = packet.packet_error; */
/*    gp_circ_buffer[temp_head].gp_state = packet.gp_state; */
/*    for(ii=0; ii<packet.packet_length; ii++) */
/*    { */
/*       gp_circ_buffer[temp_head].gp[ii] = packet.gp[ii]; */
/*    } */


/*    /\* retval = gp_copy_packet(packet, &(gp_circ_buffer[temp_head])); *\/ */
/*    /\* if(retval != GP_SUCCESS) *\/ */
/*    /\* { *\/ */
/*    /\*    GPIO_SetBits(GPIOD, LED_PIN_RED); *\/ */
/*    /\*    while(1); *\/ */
/*    /\*    return retval; *\/ */
/*    /\* } *\/ */
/*    gp_circ_buffer_head = temp_head; */
/*    packet_send_mutex = 0; */

/*    /\* Enable interrupts back *\/ */
/*    if (!prim) { */
/*       __enable_irq(); */
/*    } */


/*    return GP_SUCCESS; */

/* } */


/* uint8_t send_gp_packets(void) */
/* { */
/*    GenericPacket *gp_ptr; */
/*    uint8_t ii; */

/*    while(gp_circ_buffer_head != gp_circ_buffer_tail) */
/*    { */
/*       gp_circ_buffer_tail = gp_circ_buffer_tail + 1; */
/*       if(gp_circ_buffer_tail >= GP_CIRC_BUFFER_SIZE) */
/*       { */
/*          gp_circ_buffer_tail = 0; */
/*       } */
/*       gp_ptr = &(gp_circ_buffer[gp_circ_buffer_tail]); */

/*       /\* while(packet_send_mutex != 0); *\/ */
/*       /\* packet_send_mutex = 1; *\/ */
/*       /\* for(ii=0; ii<gp_ptr->packet_length; ii++) *\/ */
/*       /\* { *\/ */
/*       /\*    usart_write_byte(gp_ptr->gp[ii]); *\/ */
/*       /\* } *\/ */
/*       /\* packet_send_mutex = 0; *\/ */

/*    } */
/* } */

void write_timestamps(void)
{
   uint8_t ii;

   while(ts_circ_buffer_tail != ts_circ_buffer_head)
   {
      ts_circ_buffer_tail = ts_circ_buffer_tail + 1;
      if(ts_circ_buffer_tail >= TS_CIRC_BUFFER_SIZE)
      {
         ts_circ_buffer_tail = 0;
      }

      if(usart_one_initialized)
      {
         for(ii=0; ii<ts_circ_buffer[ts_circ_buffer_tail].packet_length; ii++)
         {
            usart_write_byte(ts_circ_buffer[ts_circ_buffer_tail].gp[ii]);
         }
      }
      else if(usart_one_dma_initialized)
      {
         usart_write_dma((uint8_t *)ts_circ_buffer[ts_circ_buffer_tail].gp, ts_circ_buffer[ts_circ_buffer_tail].packet_length);
      }
   }
}



void write_vospi(void)
{
   uint8_t ii;

   while(vospi_circ_buffer_tail != vospi_circ_buffer_head)
   {
      vospi_circ_buffer_tail = vospi_circ_buffer_tail + 1;
      if(vospi_circ_buffer_tail >= VOSPI_CIRC_BUFFER_SIZE)
      {
         vospi_circ_buffer_tail = 0;
      }

      if(usart_one_initialized)
      {
         for(ii=0; ii<vospi_circ_buffer[vospi_circ_buffer_tail].packet_length; ii++)
         {
            usart_write_byte(vospi_circ_buffer[vospi_circ_buffer_tail].gp[ii]);
         }
      }
      else if(usart_one_dma_initialized)
      {
         usart_write_dma((uint8_t *)vospi_circ_buffer[vospi_circ_buffer_tail].gp, vospi_circ_buffer[vospi_circ_buffer_tail].packet_length);
      }
   }
}


GenericPacket * get_next_vospi_ptr(void)
{
   GenericPacket *ptr;
   uint32_t temp_head;

   temp_head = vospi_circ_buffer_head + 1;
   if(temp_head >= VOSPI_CIRC_BUFFER_SIZE)
   {
      temp_head = 0;
   }
   ptr = (GenericPacket *)&(vospi_circ_buffer[temp_head]);

   return ptr;

}

void increment_vospi_head(void)
{
   vospi_circ_buffer_head = vospi_circ_buffer_head + 1;
   if(vospi_circ_buffer_head >= VOSPI_CIRC_BUFFER_SIZE)
   {
      vospi_circ_buffer_head = 0;
   }
}


void write_code_version(void)
{
   GenericPacket packet;
   uint8_t ii;

   if(create_universal_code_ver(&packet, GIT_REVISION) == GP_SUCCESS)
   {

      if(usart_one_initialized)
      {
         for(ii=0; ii<packet.packet_length; ii++)
         {
            usart_write_byte(packet.gp[ii]);
         }
      }
      else if(usart_one_dma_initialized)
      {
         usart_write_dma((uint8_t *)packet.gp, packet.packet_length);
      }
   }
}


uint8_t get_next_outgoing_gp_head(uint32_t *next_outgoing_circ_buffer_head)
{
   uint8_t retval;

   retval = 0;
   if(outgoing_circ_buffer_head_temp == outgoing_circ_buffer_head)
   {
      outgoing_circ_buffer_head_temp = outgoing_circ_buffer_head_temp + 1;
      if(outgoing_circ_buffer_head_temp >= OUTGOING_CIRC_BUFFER_SIZE)
      {
         outgoing_circ_buffer_head_temp = 0;
      }
      *next_outgoing_circ_buffer_head = outgoing_circ_buffer_head_temp;
   }
   else
   {
      /* We cannot increment temp head because we haven't finished writing
         the last packet yet.  Deal with it...
      */
      retval = 1;
   }

   return retval;
}


void increment_outgoing_gp_head(void)
{
   outgoing_circ_buffer_head = outgoing_circ_buffer_head_temp;
}


void write_outgoing(void)
{

   uint8_t ii;

   while(outgoing_circ_buffer_tail != outgoing_circ_buffer_head)
   {
      outgoing_circ_buffer_tail = outgoing_circ_buffer_tail + 1;
      if(outgoing_circ_buffer_tail >= OUTGOING_CIRC_BUFFER_SIZE)
      {
         outgoing_circ_buffer_tail = 0;
      }

      if(usart_one_initialized)
      {
         for(ii=0; ii<outgoing_circ_buffer[outgoing_circ_buffer_tail].packet_length; ii++)
         {
            usart_write_byte(outgoing_circ_buffer[outgoing_circ_buffer_tail].gp[ii]);
         }
      }
      else if(usart_one_dma_initialized)
      {
         usart_write_dma((uint8_t *)outgoing_circ_buffer[outgoing_circ_buffer_tail].gp, outgoing_circ_buffer[outgoing_circ_buffer_tail].packet_length);
      }
   }


