akwalker2048/stm32f4_generic_template/src/hardware_STM32F407G_DISC1.c
}



uint8_t read_adc(float *vc14, float *vc15)
{
   uint16_t c14, c15;

   /* VDD = 2.935 Volts on discovery card. */

   if(adc_initialized)
   {
      ADC_RegularChannelConfig(ADC1, ADC_Channel_14, 1, ADC_SampleTime_28Cycles);
      // Start the conversion
      ADC_SoftwareStartConv(ADC1);
      // Wait until conversion completion
      while(ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
      // Get the conversion value
      c14 = ADC_GetConversionValue(ADC1);

      ADC_RegularChannelConfig(ADC1, ADC_Channel_15, 1, ADC_SampleTime_28Cycles);
      // Start the conversion
      ADC_SoftwareStartConv(ADC1);
      // Wait until conversion completion
      while(ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
      // Get the conversion value
      c15 = ADC_GetConversionValue(ADC1);

      *vc14 = ((float)c14 / (float)4096) * 2.935f;
      *vc15 = ((float)c15 / (float)4096) * 2.935f;
   }
   else
   {
      *vc14 = -9.99;
      *vc15 = -9.99;
   }

   return 0;
}


void process_usart3_buffer(void)
{
   GenericPacket packet;
   char tchar[2];

   /* Debug Sonar Packet! */
   /* sonar_data[0] = 0x31; */
   /* sonar_data[1] = 0x32; */
   /* sonar_data[2] = 0x33; */
   /* sonar_data[3] = 0; */
   /* create_sonar_maxbot_serial(&packet, (char *)sonar_data); */
   /* usart_write_dma(packet.gp, packet.packet_length); */

   while(usart3_circ_buffer_tail != usart3_circ_buffer_head)
   {
      /* if(GPIO_ReadInputDataBit(GPIOD, LED_PIN_RED) == Bit_SET) */
      /* { */
      /*    GPIO_ResetBits(GPIOD, LED_PIN_RED); */
      /* } */
      /* else */
      /* { */
      /*    GPIO_SetBits(GPIOD, LED_PIN_RED); */
      /* } */

      usart3_circ_buffer_tail++;
      if(usart3_circ_buffer_tail >= USART3_CIRC_BUFFER_SIZE)
      {
         usart3_circ_buffer_tail = 0;
      }

      /* Temp Debug */
      tchar[0] = usart3_circ_buffer[usart3_circ_buffer_tail];
      tchar[1] = 0;
      create_universal_str(&packet, tchar);
      usart_write_dma(packet.gp, packet.packet_length);

      switch(usart3_circ_buffer[usart3_circ_buffer_tail])
      {
         case 0x52:
            /* This is an R!  The next byte will be sonar data. */
            sonar_index = 0;
            break;
         case 0x0D:
            /* This is a Carriage Return!  This ends this set of sonar data. */
            sonar_index = 3;
            sonar_data[sonar_index] = 0;
            create_sonar_maxbot_serial(&packet, (char *)sonar_data);
            usart_write_dma(packet.gp, packet.packet_length);
            sonar_index = 0;
            break;
         default:
            /* Add characters to the next packet! */
            if(sonar_index < 4)
            {
               sonar_data[sonar_index] = usart3_circ_buffer[usart3_circ_buffer_tail];
               sonar_index++;
            }
            else
            {
               /* sonar_data[3] = 0; */
               /* create_sonar_maxbot_serial(&packet, (char *)sonar_data); */
               /* usart_write_dma(packet.gp, packet.packet_length); */
            }
            break;
      }

   }

}
